Autodesk.Navisworks.Api.ApplicationParts.ApplicationResources
Provides access to Application Resources

Autodesk.Navisworks.Api.ApplicationParts.ApplicationResources.GetString(System.String)
Looks up a localizable string
name:
The identifier of the string to lookup
Returns:
Returns localized string
Throws System.ArgumentNullException:
The identifier is Null.
Throws System.ArgumentException:
Failed to look up string with specified identifier

Autodesk.Navisworks.Api.ApplicationParts.ApplicationResources.GetStringSafe(System.String)
Looks up a localizable string
name:
The identifier of the string to lookup
Returns:
Returns localized string or value of 'name' if it cannot be found
Throws System.ArgumentNullException:
The identifier is Null.

Autodesk.Navisworks.Api.ApplicationParts.ApplicationResources.TryGetString(System.String)
Looks up a localizable string
name:
The identifier of the string to lookup
Returns:
Returns localized string or Null if it cannot be found
Throws System.ArgumentNullException:
The identifier is Null.